dct_rename_area = {
    '12': 
        {'м.Орджонікідзе':'м.Покров', 
        'м.Дніпродзержинськ':"м.Кам'янське", 
        'м.Дніпропетровськ':'м.Дніпро', 
        'Дніпропетровський район':'Дніпровський район'}, 
    '14': 
        {'Володарський район':'Нікольський район', 
        'м.Красний Лиман':'м.Лиман', 
        'Першотравневий район':'Мангушський район', 
        'Красноармійський район':'Покровський район', 
        'м.Красноармійськ':'м.Покровськ', 
        'м.Артемівськ':'м.Бахмут', 
        'Артемівський район':'Бахмутський район', 
        'м.Дзержинськ':'м.Торецьк',
        'м.Димитров':'м.Мирноград'}, 
    '18': 
        {'Червоноармійський район':'Пулинський район', 
        'Володарськ-Волинський район':'Хорошівський район'},
    '21':
        {'м.Мукачеве':'м.Мукачево'},
    '23': 
        {'Куйбишевський район':'Більмацький район'}, 
    '32':
        {'м.Переяслав-Хмельницький':'м.Переяслав'},
    '35': 
        {'м.Кіровоград':'м.Кропивницький', 
        'Ульяновський район':'Благовіщенський район', 
        'Кіровоградський район': 'Кропивницький район'},
    '48': 
        {'Жовтневий район':'Вітовський район'}, 
    '51': 
        {'Котовський район':'Подільський район', 
         'Красноокнянський район':'Окнянський район', 
         'м.Іллічівськ':'м.Чорноморськ', 
         'Фрунзівський район':'Захарівський район', 
         'Комінтернівський район':'Лиманський район',
         'м.Котовськ':'м.Подільськ'}, 
    '53': 
        {'м.Комсомольськ':'м.Горішні Плавні'},
    '56':
        {'м.Кузнецовськ':'м.Вараш'},
    '65': 
        {'Цюрупинський район':'Олешківський район'}, 
    '74': 
        {'Щорський район':'Сновський район'}}


dct_cities = {"кам'янське":"м.кам'янське", 
               'кривий ріг':'м.кривий ріг', 
               'дніпро':'м.дніпро',
               'донецьк':'м.донецьк',
               'маріуполь':'м.маріуполь',
               'житомир':'м.житомир',
               'запоріжжя':'м.запоріжжя',
               'кропивницький':'м.кропивницький',
               'львів':'м.львів',
               'луганськ':'м.луганськ',
               'макіївка':'м.макіївка',
               'миколаїв':'м.миколаїв',
               'одеса':'м.одеса',
               'кременчук':'м.кременчук',
               'полтава':'м.полтава',
               'суми':'м.суми',
               'харків':'м.харків',
               'херсон':'м.херсон',
               'черкаси':'м.черкаси',
               'чернігів':'м.чернігів'}

kyiv_dict = {'печерський район міста':'Печерський', 
             'дарницький район міста':'Дарницький', 
             "солом'янський район міста":"Солом'янський", 
             'святошинський район міста':'Святошинський', 
             'оболонський район міста':'Оболонський', 
             'голосіївський район міста':'Голосіївський', 
             'подільський район міста':'Подільський', 
             'дніпровський район міста':'Дніпровський', 
             'шевченківський район міста':'Шевченківський', 
             'деснянський район міста':'Деснянський'}

dct_replace = {
    '05101':{
        'Замостянський':'м.Вінниця', 
        'Ленінський':'м.Вінниця', 
        'Староміський':'м.Вінниця'},
    '05104':{
        'с.Одая':'с-ще Одая', 
        'с.Сонячне':'с-ще Сонячне'},
    '05202':{
        'с-ще Слобода-Ходацька':'с.Слобода-Ходацька'},
    '05204':{
        'с.Велика Кириївка':'с.Велика Киріївка'},
    '05216':{
        'с-ще Голендри':'с.Голендри'},
    '05230':{
        'с.Кірова':'с.Подільське',
        'с.Рачки':'с.Подільське',
        'с.Нові Обіходи':'с.Нові Обиходи'},
    '05241':{
        'с.Демківське':'с-ще Демківське'},
    '05253':{
        'с.Рахни Лісові':'с.Рахни-Лісові'},
    '12101':{
        'Кіровський':'Центральний', 
        'Жовтневий':'Соборний', 
        'Ленінський':'Новокодацький', 
        'Бабушкінський':'Шевченківський', 
        'Красногвардійський': 'Чечелівський'},
    '12104':{
        'Баглійський':'Південний'},
    '12110':{
        'Жовтневий':'Металургійний',
        'Дзержинський':'Покровський'},
    '12214':{
        'с-ще Орджонікідзе':'с.Новотаромське', 
        'с-ще Новотаромське':'с.Новотаромське',
        'с.Миколаївка':'с.Новотаромське'},
    '12220':{
        'с-ще Вишневе':'с.Вишневе', 
        'с-ще Кудашівка':'с.Кудашівка'},
    '12226':{
        'с.Малієвське':'с.Маліївське', 
        'с.Новопетрівське':'с.Миронове'},
    '12229':{
        'с-ще Першотравневе':'с.Першотравневе',
        'с-ще Східне':'с.Східне',
        'с-ще Західне':'с.Західне'},
    '12235':{
        'с.Межеріч':'с.Межиріч'},
    '12242':{
        'с.Черненкове':'с.Чорненкове'},
    '12248':{
        'с.Новоолексієвка':'с.Новоолексіївка'},
    '12252':{
        'с.Олексієвка':'с.Олексіївка',
        'с.Андрієвка':'с.Андріївка',
        'с.Ганно-Миколаєвка':'с.Ганно-Миколаївка'},
    '12254':{
        'с.Сергієвка':'с.Сергіївка'},
    '12259':{
        'с.Новотимофієвське':'с.Новотимофіївське', 
        'с.Сергієвка':'с.Сергіївка'},
    '14117':{
        'смт Олексіїво-Дружківка':'смт Олексієво-Дружківка'},
    '14123':{
        'Жовтневий':'Центральний', 
        'с.Виноградне':'м.Маріуполь', 
        'Іллічівський':'Кальміуський', 
        'Орджонікідзевський':'Лівобережний', 
        'с.Піонерське':'м.Маріуполь'},
    '14129':{
        'смт Молотаранівка':'смт Малотаранівка'},
    '14203':{
        "с.Запаро-Мар'євка":"с.Запаро-Мар'ївка"},
    '14209':{
        'с.Кірове':'с.Свято-Покровське',
        'с.Красне':'с.Іванівське',
        'с-ще Володимирівка':'с.Володимирівка',
        'с.Переізне':'с.Переїзне'},
    '14212':{
        'с.Андрієвка':'с.Андріївка', 
        'с-ще Октябрьське':'с-ще Керменчик', 
        'с.Розлив':'с-ще Розлив', 
        'с.Георгієвка':'с.Георгіївка'},
    '14215':{
        'с-ще Ближнє':'с.Ближнє',
        'с-ще Степне':'с.Степне',
        'с-ще Діанівка':'с.Діанівка',
        'с-ще Кіровське':'с.Діанівка',
        'с-ще Хлібодарівка':'с.Хлібодарівка',
        'смт Ольгінка':'смт Ольгинка',
        'с-ще Пільне':'с.Пільне',
        'с-ще Привільне':'с.Привільне',
        'с.Октябрьське':'с.Стрітенка'},
    '14217':{
        'с-ще Малинівка':'с.Малинівка', 
        'с-ще Зоря':'с.Зоря', 
        'с.Малоянісоль':'с.Малоянисоль', 
        'с-ще Гранітне':'с.Гранітне', 
        'с-ще Катеринівка':'с.Катеринівка', 
        'с.Октябрьське':'с.Криничне', 
        'с-ще Труженка':'с.Труженка', 
        'с-ще Ключове':'с.Ключове'},
    '14227':{
        'с-ще Солоне':'с.Солоне',
        'смт Новоекономічна':'смт Новоекономічне',
        'с.Червоний Лиман':'с.Красний Лиман'},
    '14233':{
        'с-ще Дачне':'с.Дачне', 
        'с-ще Янтарне':'с.Янтарне',
        'с-ще Водяне':'с.Водяне', 
        'с-ще Степне':'с.Степне', 
        'с-ще Максимівка':'с.Максимівка', 
        'с-ще Солодке':'с.Солодке', 
        'с-ще Дальнє':'с.Дальнє'},
    '14239':{
        'с-ще Приазовське':'с.Приазовське',
        'с-ще Азовське':'с.Азовське',
        'с-ще Портівське':'с.Портівське',
        'с.Білосарайська':'с.Білосарайська Коса', 
        "с-ще Дем'янівка":"с.Дем'янівка",
        'с-ще Агробаза':'с.Агробаза'},
    '18203':{
        'с.Бровки-Перші':'с.Бровки Перші'},
    '18217':{
        'с.Рудня Іванівська':'с.Рудня-Іванівська'},
    '18228':{
        'с-ще Станційне':'с.Станційне'},
    '18242': {
        'с-ще Білокамінка':'с.Білокамінка'},
    '18244':{
        'с.Рудня Озерянська':'с.Рудня-Озерянська',
        'с.Майдан Копищенський':'с.Майдан-Копищенський'},
    '18254':{
        'с-ще Молодіжне':'с.Молодіжне', 
        'с-ще Ягодинка':'с.Ягодинка'},
    '18258':{
        'с-ще Суслівка':'с.Суслівка',
        'смт Чуднів':'м.Чуднів',
        'с-ще Шевченка':'с.Шевченка'},
    '21204':{
        'с.Бодалово':'с.Бадалово'},
    '21227':{
        'с.Кендерешів':'с.Коноплівці'},
    '21232':{
        "с.Тур'я Бистра":"с.Тур'я-Бистра",
        "с.Тур'я бистра":"с.Тур'я-Бистра"},
    '21244':{
        'с.Вонігово':'с.Вонігове'},
    '21248':{
        'с.Верхнє Солотвино':'с.Верхня Солотвина', 
        'с.Холмці':'с.Холмець', 
        'с.Ратовці':'с.Ратівці'},
    '21253':{
        'с.Бороняво':'с.Боронява',
        'с.Крайна':'с.Крайнє'},
    '23101':{
        'Орджонікідзевський':'Вознесенівський',
        'Жовтневий':'Олександрівський',
        'смт Тепличне':'Шевченківський',
        'Ленінський':'Дніпровський'},
    '23215':{
        'с.Багатирівка':'с.Богатирівка'},
    '23218':{
        'с-ще Гуляйпільське':'с.Гуляйпільське',
        'с-ще Комсомольське':'с.Гуляйпільське',
        'с-ще Червоне':'с.Червоне'},
    '23221':{
        'с.Біленьке-Перше':'с.Біленьке Перше'},
    '23242':{
        'с.Улянівка':'с.Ожерельне'},
    '26208':{
        'с.Устерікі':'с.Устеріки'},
    '26212':{
        "с.Загір'я Кукільницьке":"с.Загір'я-Кукільницьке"},
    '26220':{
        'с.Слобода Долинська':'с.Слобода-Долинська',
        'с.Слобода Болехівська':'с.Слобода-Болехівська'},
    '26232':{
        'с.Воскресінці':'с.Воскресинці'},
    '26248':{
        'с.Слобода Рівнянська':'с.Слобода-Рівнянська', 
        'с.Слобода Небилівська':'с.Слобода-Небилівська'},
    '32105':{
        'с.Несторівка':'м.Бориспіль'},
    '32202':{
        'с.Паршиків':'с.Паришків',
        'с-ще Садове':'с.Садове'},
    '32204':{
        'с.Олійникова-Слобода':'с.Олійникова Слобода'},
    '32208':{
        'с.Петрівське':'с.Петропавлівське'},
    '32212':{
        'с.Кулажінци':'с.Кулажинці'},
    '32214':{
        'с.Вільшанська-Новоселиця':'с.Вільшанська Новоселиця',
        'с.Степове':'с.Лосятин'},
    '32224':{
        'с.Княжічі':'с.Княжичі'},
    '32242':{
        'с.Васіліха':'с.Василиха'},
    '32246':{
        'с.Бурковці':'с.Бурківці',
        'с.Деніхівка':'с.Денихівка'},
    '35101':{
        'Кіровський':'Фортечний', 
        'Ленінський':'Подільський'},
    '35203':{
        'с.Новоселівка':'с-ще Новоселівка',
        'с.Комінтерн':'с-ще Новоселівка'},
    '35222':{
        'с.Золоми':'с.Заломи'},
    '35249':{
        'с-ще Володимирівка':'с.Володимирівка',
        'с-ще Рядове':'с.Рядове'},
    '44209':{
        'с.Заіківка':'с.Заїківка'},
    '44240':{
        'с.Преображене':'с.Преображенне'},
    '44231':{
        'с.Новоахтирка':'с.Новоохтирка'},
    '44233':{
        'с.Тевяшеве':"с.Тев'яшеве",
        'с.Пелагеївка':'с.Пелагіївка'},
    '44254':{
        'с.Богачка':'с.Багачка',
        'с-ще Привілля':'с.Привілля'},
    '46203':{
        'с.Гаї-Смоленскі':'с.Гаї-Смоленські'},
    '46209':{
        'с.Тулиголови':'с.Тулиголове'},
    '46212':{
        'с.Отриничі':'с.Ортиничі'},
    '46215':{
        'с.Демянка-Надднистрянська':"с.Дем'янка-Наддністрянська"},
    '44216':{
        'с.Діброва':'с-ще Діброва'},
    '46221':{
        'с.Тадан':'с.Тадані'},
    '46230':{
        'с.Мала Горожана':'с.Мала Горожанна',
        'с.Крупсько':'с.Крупське'},
    '46239':{
        'с.Паздимир':'с.Поздимир'},
    '46242':{
        'с.Воля-Бранецька':'с.Воля-Баранецька'},
    '46245':{
        'с.Зимівка':'с.Зимівки', 
        'смт Славсько':'смт Славське'},
    '46251':{
        'с.Городивичі':'с.Голдовичі',
        'с.Велика-Волосянка':'с.Велика Волосянка'},
    '46248':{
        'с.Свитязі':'с.Свитазів'},
    '46258':{
        'с.Щеплати':'с.Щеплоти',
        'с.Руда Краковецька':'с.Руда-Краковецька',
        "с.Передбір'я":"с.Передвір'я"},
    '48101':{
        'Ленінський':'Інгульський'},
    '48209':{
        'с.Червона Україна':'с.Українка'},
    '48251':{
        'с-ще Рівне':'с.Рівне'},
    '48257':{
        'с.Поляна':'с-ще Поляна'},
    '51105':{
        'с-ще Повстанське':'с.Повстанське'},
    '51202':{
        'с.Ананьїв Перший':'с.Ананьїв',
        'с.Ананьїв Другий':'с.Ананьїв'},
    '51212':{
        'с-ще Жовтнівка':'с.Виноград',
        'с-ще Семихатки':'с.Семихатки',
        'с-ще Виноград':'с.Виноград'},
    '51214':{
        'с-ще Тополине':'с.Тополине', 
        'с-ще Оксамитне':'с.Оксамитне'},
    '51223':{
        'с.Миколаівка':'с.Миколаївка'},
    '51225':{
        'с.Олексіівка':'с.Олексіївка',
        'с.Будеі':'с.Будеї'},
    '51227':{
        'с-ще Гвардійське':'с.Гвардійське'},
    '51229':{
        'с.Нестоіта':'с.Нестоїта',
        'с.Мардаровка':'с.Мардарівка'},
    '51231':{
        'с.Малаівці':'с.Малаївці'},
    '51233':{
        'с.Сергіівка':'с.Сергіївка'},
    '51239':{
        'с-ще Степове':'с.Степове'},
    '51245':{
        'с-ще Розівка':'с.Розівка'},
    '51235':{
        'с.Улянівка':'с.Ульяновка', 
        'с.Уляновка':'с.Ульяновка', 
        'с.Настасіівка':'с.Настасіївка'},
    '51254':{
        'с.Новопетрівка Перша':'с.Новопетрівка', 
        'с.Новопетрівка Друга':'с.Новопетрівка'},
    '53101':{
        'Октябрський':'Шевченківський',
        'Ленінський':'Подільський'},
    '53206':{
        'м.Глобино':'м.Глобине'},
    '53210':{
        'с-ще Діброва':'с.Діброва', 
        'с-ще Чапаєвка':'с.Діброва'},
    '53216':{
        'с.Шевченка':'с-ще Шевченка',
        'с.Михайлівське':'с-ще Михайлівське',
        'с.Халтурине':'с.Мартинівка',
        'с.Вакулиха':'с-ще Вакулиха',
        'с.Красне':'с-ще Красне',
        'с.Солона Балка':'с-ще Солона Балка',
        'с.Іванівка':'с-ще Іванівка',
        'с.Голобородьківське':'с-ще Голобородьківське',
        'с.Тагамлицьке':'с-ще Тагамлицьке'},
    '53218':{
        'с.Грицаівка':'с.Грицаївка'},
    '53228':{
        'с-ще Новооріхівка':'с.Новооріхівка'},
    '53232':{
        'с.Декабристів':'с-ще Декабристів'},
    '53236':{
        'с-ще Вишневе':'с.Вишневе', 
        'с-ще Куйбишеве':'с.Вишневе'},
    '53240':{
        'с.Терентіівка':'с.Терентіївка'},
    '53242':{
        'с.Шкурупіівка':'с.Шкурупіївка',
        'с.Покровське':'с-ще Покровське',
        'смт Решетилівка':'м.Решетилівка',
        'с.Жовтневе':'с-ще Покровське'},
    '53245':{
        'с.Старий Калкаів':'с.Старий Калкаїв'},
    '56212':{
        'с.Угольці':'с.Угільці'},
    '59101':{
        'с.Верхне Піщане':'с.Верхнє Піщане'},
    '59203':{
        'с.Підлозієвка':'с.Підлозіївка', 
        'с.Кудрявоє':'с.Кудряве'},
    '59206':{
        'с-ще Тімірязівка':'с-ще Тімірязєвка'},
    '59209':{
        'с.Нечаівка':'с.Нечаївка'},
    '59212':{
        'с.Заводське':'смт Кириківка'},
    '59220':{
        'с-ще Заводи':'с-ще Шевченківське'},
    '59247': {
        'с-ще Сад':'с.Сад'},
    '61204':{
        'с.Нараів':'с.Нараїв'},
    '61216':{
        'с.Паівка':'с.Паївка',
        'с.Орішківці':'с.Оришківці'},
    '61226':{
        'с.Воробіівка':'с.Воробіївка'},
    '61230':{
        'с.Мала Плавучка':'с.Мала Плавуча'},
    '61234':{
        'с.Старий Почаів':'с.Старий Почаїв',
        'с.Гаі':'с.Гаї', 
        'с.Савчинці':'с.Савчиці', 
        'с.Дунаів':'с.Дунаїв'},
    '61242':{
        'с.Красіів':'с.Красіїв'},
    '61246':{
        'с.Гниличики':'с.Гнилички'},
    '61252':{
        'с.Чистілів':'с.Чистилів', 
        'с.Прощова':'с.Прошова'},
    '61258':{
        'с.Матвіівці':'с.Матвіївці', 
        'с.Кудлаівка':'с.Кудлаївка'},
    '63101':{
        'Дзержинський':'Шевченківський', 
        'Жовтневий':'Новобаварський', 
        'Орджонікідзевський':'Індустріальний', 
        'Комінтернівський':'Слобідський', 
        'Червонозаводський':"Основ'янський", 
        'Ленінський':'Холодногірський', 
        'Фрунзенський':'Немишлянський'},
    '63202':{
        'с-ще Раківка':'смт Савинці'},
    '63206':{
        'с-ще Садове':'с.Садове'},
    '63208':{
        'с.Улянівка':'с-ще Улянівка'},
    '63216':{
        'с-ще Профінтерн':'с.Вишневе',
        'с-ще Новоолександрівка':'с.Новоолександрівка',
        'с-ще Вірівка':'с.Вірівка'},
    '63217':{
        'с-ще Водяне':'с.Водяне', 
        'с-ще Роздольне':'с.Роздольне', 
        'с-ще Першотравневе':'с.Першотравневе', 
        'с-ще Красна Поляна':'с.Красна Поляна'},
    '63218':{
        'с-ще Великий Виселок':'с.Великий Виселок',
        'с.Мануїлівка':'с.Першотравневе'},
    '63220':{
        'с-ще Дворічний Кут':'с.Дворічний Кут'},
    '63231':{
        'с.Бесарабівка':'с.Бессарабівка'},
    '63237':{
        'с-ще Орлянка':'с.Орлянка', 
        'с-ще Ягідне':'с.Ягідне', 
        'с-ще Лісна Стінка':'с.Лісна Стінка'},
    '63242':{
        'с-ще Комінтерн':'с.Слобожанське', 
        'с-ще Слобожанське':'с.Слобожанське', 
        'с-ще Ватутіне':'с.Ватутіне'},
    '63245':{
        'с-ще Червоне':'с.Червоне'},
    '65101':{
        'Комсомольський':'Корабельний'},
    '65107':{
        'м.Тавріїськ':'м.Таврійськ'},
    '65203':{
        'с-ще Східне':'с.Східне'},
    '65218':{
        'с.Мала Шестерня':'с.Мала Шестірня'},
    '65229':{
        'с.Новодмитрівка-Друга':'с.Новодмитрівка Друга'},
    '65238':{
        'с-ще Заповітне':'с.Заповітне',
        'с-ще Вільне':'с.Вільне',
        'с-ще Братське':'с.Братське',
        'с-ще Донцове':'с.Донцове',
        'с-ще Дальне':'с-ще Дальнє',
        'с-ще Змагання':'с.Змагання'},
    '65247':{
        'с.Шевченка':'с.Шевченко',
        'с.Миколаівка':'с.Миколаївка'},
    '65250':{
        'с-ще Цюрупинське':'с-ще Пойма'},
    '68212':{
        'с.Мала Яромірка':'с.Мала Яромирка', 
        'с.Велика Яромірка':'с.Велика Яромирка'},
    '68227':{
        'с.Дружнє':'с.Дружне'},
    '68239':{
        "с.Д'яків":"с.Дяків"},
    '71206': {
        'с.Драбове-Барятинське':'с-ще Драбове-Барятинське',
        'смт Шрамківка':'с.Шрамківка'},
    '71212':{
        'с.Богачівка':'с.Багачівка'},
    '71215':{
        'с.Пальміра':'с-ще Пальміра',
        'с.Плешкани':'с.Плешкані'},
    '71231':{
        'с.Паланочки':'с.Паланочка'},
    '71234':{
        'с.Летицівка':'с.Летичівка'},
    '71237':{
        'с.Чубівка':'с.Ленське'},
    '71251':{
        'с.Ставківка':'с.Савківка'},
    '73101':{
        'Шевченківський':'м.Чернівці',
        'Садгірський':'м.Чернівці',
        'Першотравневий':'м.Чернівці'},
    '73245':{
        'с.Зруб-Комарівці':'с.Зруб-Комарівський',
        'с.Аршица':'с.Аршиця'},
    '74203':{
        'с.Крапивне':'с.Кропивне', 
        'с.Фастовци':'с.Фастівці', 
        'смт Батурин':'м.Батурин'},
    '74211':{
        'с.Брагінці':'с.Брагинці'},
    '74220':{
        'с.Калитянське':'с-ще Калитянське'},
    '74241':{
        'с.Билорічиця':'с.Білорічиця'},
    '74247':{
        'с.Іванпуть':'с-ще Іванпуть'},
    '74258':{
        'с.Гуто-Студенецька':'с.Гута-Студенецька'},
        }

place_change = [('26240','с.Саджавка','26106'), ('68239', 'с.Голики', '68106'),('68239', 'с.Старий Кривин', '68105'), 
                ('14209','с.Іванград','14103'), ('14209','с-ще Зеленопілля','14103'), ('14209', 'с-ще Опитне','14103'),
                ('14209', 'с.Покровське','14103'),('14209', 'с.Зайцеве','14103'), ('14209', 'с-ще Хромове','14103'),
                ('14209','с.Клинове','14103'),('14209','с.Відродження','14103'),('14209','с.Кліщіївка','14103'),
                ('14209','с.Іванівське','14103'),('14141','м.Миколаївка','14242'),('51210','м.Біляївка','51105'),
                ('51210', 'с-ще Повстанське','51105'), ('51210', 'с.Майори','51105'),('48220','с.Ракове', '48102'),
                ('48220','с.Новогригорівка','48102'),('56242','с.Розваж','56109'), ('14233','с.Водяне','14148'),
                ('14233','с.Павлівка','14148'),('14233','с.Степне','14148'),('14233','с.Солодке','14148'),
                ('61226','с.Плесківці','61101'),('61226','с.Іванківці','61101'),('61226','с.Глядки','61101'),
                ('61226','с.Малашівці','61101'), ('61226','с.Кобзарівка','61101'),('61226','с.Чернихів','61101'),
                ('61226','с.Курівці','61101'),('61226','с.Вертелка','61101'),('46251','с.Голдовичі','46215'),
                ('14103','м.Часів Яр','14209'),('14103','м.Соледар','14209'),('65223','с.Білогрудове','65103'),
                ('65223','м.Гола Пристань','65103'),('65223',"с.Стара Збур'ївка",'65103'),('61234',"м.Кременець",'61107'),
                ('18240','с.Маковиці','18110'),('18240','с.Майстрів','18110'),('18240','с.Майстрова Воля','18110'),
                ('05210','с.Межирів','05103'),('05210','с.Жуківці','05103'),('05210','с.Сідава','05103'),
                ('05210','с.Рів','05103'),('05210','с.Коростівці','05103'),('07218','с.Прилуцьке','07101'),
                ('07218','с.Жабка','07101'),('07218','с.Дачне','07101'),('07218','с.Сапогове','07101'),
                ('46118','м.Соснівка','46248'),('59253','с.Ображіївка','59110'),('59253','с.Погребки','59110'),
                ('59253','с.Остроушки','59110'),('05206','смт Десна','05101'),('21227','с.Шенборн','21104'),
                ('21227','с.Павшино','21104'),('21227','с.Дерцен','21104'),('21227','с.Лавки','21104'),
                ('21227','с.Нижній Коропець','21104'),('21227','с.Нове Давидково','21104'),('26228','с.Середній Бабин','26104'),
                ('26228','с.Мостище','26104'),('26228','с.Вістова','26104'),('26228','с.Кропивник','26104'),
                ('26228','с.Сівка-Калуська','26104'),('26228','с.Студінка','26104'),('53204','м.Гадяч','53103'),
                ('53204','с.Біленченківка','53103'),('56208','с.Заболоття','56107'),('74233','с.Кунашівка','74104'),
                ('12229','с.Шолохове','12121'),('51206','с.Лісничівка','51102'),('51206','с.Оленівка','51102'),
                ('51206','с.Перельоти','51102'),('51206','с.Обжиле','51102'),('51206','с.Євтодія','51102'),
                ('51206','с.Мирони','51102'),('51206','с.Борсуки','51102'),('51206','с.Бендзари','51102'),
                ('51206','с.Пасицели','51102'),('51206','с.Гольма','51102'),('51206','м.Балта','51102'),
                ('51206','с.Коритне','51102'),('51206','с.Білине','51102'),('51206','с.Кармалюківка','51102'),
                ('51206','с.Козацьке','51102'),('51206','с.Акулинівка','51102'),('51206','с.Перейма','51102'),
                ('51206','с.Березівка','51102'), ('51206','с.Пасат','51102'),('51206','с.Андріяшівка','51102'),
                ('51206','с.Саражинка','51102'),('51206','с.Немирівське','51102'),('73240','с.Ломачинці','73106'),
                ('59203','с.Климентове','59102'),('59203','с.Сосонка','59102'),('12254','с.Іллінка','12113'),
                ('12254','с.Новокиївка','12113'),('12254','с.Добра Надія','12113'),('05248','с.Соколова','05109'),
                ('26232','с.Іванівці','26106'),('26232','с.Товмачик','26106'),('26232','с.Шепарівці','26106'),
                ('26232','с.Воскресинці','26106'),('61255','с.Переходи','61103'),('61255','с.Скородинці','61103'),
                ('61255','с.Росохач','61103'),('61255','с.Бичківці','61103'),('61255','с.Пастуше','61103'),
                ('61255','с.Біла','61103'),('61255','с.Горішня Вигнанка','61103'),('61204','м.Бережани','61105'),
                ('61204','с.Рай','61105'),('63239','с.Степове','63110'),('63239','с.Полтавське','63110'),
                ('63239','с.Катеринівка','63110'),('63239','с.Копані','63110'),('63239','с.Вільне','63110'),
                ('63239','с-ще Чернігівське','63110'),('63239','с.Олексіївка','63110'),('63239','с.Світловщина','63110'),
                ('63239','с.Мирне','63110'),('63239','с-ще Миролюбівка','63110'),('63239','с-ще Кінне','63110'),
                ('63239','с.Нестеліївка','63110'),('63239','с.Олександрівка','63110'),('63239','с.Царедарівка','63110'),
                ('63239','с.Нова Іванівка','63110'),('63239','с-ще Лагідне','63110'),('63228',"с.Кам'янка",'63104'),
                ('74236','м.Новгород-Сіверський','74105'),('23206','с.Азовське','23104'),('14230','с.Шандриголове','14133'),
                ('14230','смт Зарічне','14133'),('14230','смт Новоселівка','14133'),('14230','смт Дробишеве','14133'),
                ('14230','с.Липове','14133'),('14230','с.Озерне','14133'),('14230','с.Лозове','14133'),
                ('14230','с.Рідкодуб','14133'),('14230','с.Коровій Яр','14133'),('14230','с.Яцьківка','14133'),
                ('14230','с.Терни','14133'),('14230','смт Ямпіль','14133'),('14230','с.Торське','14133'),
                ('14230','смт Ярова','14133'),('14230','с-ще Нове','14133'),('14230','с-ще Соснове','14133'),
                ('14230','с.Закітне','14133'),('14230','с.Олександрівка','14133'),('14230','с.Рубці','14133')]

dct_rename_area_2022={
    'UA46000000000026241':{
        'м.Львів':'Львівський район'},
    'UA26000000000069363':{
        'м.Калуш':'Калуський район', 
        'м.Коломия':'Коломийський район'},
    'UA51000000000030770':{
        'м.Одеса':'Одеський район',
        'Малиновський':'Хаджибейський'},
    'UA35000000000016081':{
        'м.Кропивницький':'Кропивницький район'},
    'UA48000000000039575':{
        'м.Миколаїв':'Миколаївський район'},
    'UA21000000000011690':{
        'м.Мукачево':'Мукачівський район'},
    'UA05000000000010236':{
        'м.Вінниця':'Вінницький район', 
        'м.Жмеринка':'Жмеринський район'},
    'UA14000000000091971':{
        'м.Маріуполь':'Маріупольський район'},
    'UA65000000000030969':{
        'м.Херсон':'Херсонський район'},
    'UA18000000000041385':{
        'м.Житомир':'Житомирський район', 
        'Новоград-Волинський район':'Звягельський район'},
    'UA23000000000064947':{
        'м.Бердянськ':'Бердянський район',
        'м.Запоріжжя':'Запорізький район'},
    'UA12000000000090473':{
        'м.Дніпро':'Дніпровський район',
        "м.Кам'янське":"Кам'янський район",
        'м.Кривий Ріг':'Криворізький район',
        'м.Покров':'Нікопольський район'},
    'UA61000000000060328':{
        'м.Кременець':'Кременецький район',
        'м.Чортків':'Чортківський район'},
    'UA74000000000025378':{
        'м.Новгород-Сіверський':'Новгород-Сіверський район',
        'м.Чернігів':'Чернігівський район'},
    'UA53000000000028050':{
        'м.Кременчук':'Кременчуцький район',
        'м.Полтава':'Полтавський район'},
    'UA71000000000010357':{
        'м.Черкаси':'Черкаський район'},
    'UA63000000000041885':{
        'м.Лозова':'Лозівський район',
        'м.Харків':'Харківський район',
        'м.Ізюм':'Ізюмський район'},
    'UA59000000000057109':{
        'м.Охтирка':'Охтирський район',
        'м.Суми':'Сумський район',
        'м.Шостка':'Шосткинський район'}}

dct_rename_area_2023={
    'UA51000000000030770':{
        'Суворовський':'Пересипський',
        'Малиновський':'Хаджибейський'},
    'UA18000000000041385':{
        'м.Новоград-Волинський':'м.Звягель',
        'Новоград-Волинський район':'Звягельський район'},
    'OC00000000000000000': {
        'м.Відень': 'Австрія',
        
        'м.Брюссель': 'Бельгія',

        'м.Варна': 'Болгарія',
        'м.Софія': 'Болгарія',

        'м.Лондон': 'Велика Британія',

        'м.Афіни': 'Греція',
        'м.Тбілісі': 'Грузія',

        'м.Копенгаген': 'Данія',

        'м.Таллінн': 'Естонія',
        'м.Тарту': 'Естонія',

        'м.Мадрид': 'Іспанія',

        'м.Барі': 'Італія',
        'м.Мілан': 'Італія',
        'м.Рим': 'Італія',

        'м.Дублін': 'Ірландія',

        'м.Едмонтон': 'Канада',
        'м.Торонто': 'Канада',

        
        'м.Рига': 'Латвія',
        'м.Каунас': 'Литва',

        'м.Люксембург': 'Люксембург',

        'м.Кишинів': 'Молдова',

        'м.Гронінген': 'Нідерланди',
        'м.Роттердам': 'Нідерланди',
        


        'м.Берлін': 'Німеччина',
        'м.Гамбург': 'Німеччина',
        'м.Кельн': 'Німеччина',
        'м.Лейпциг': 'Німеччина',
        'м.Мюнхен': 'Німеччина',
        'м.Франкфурт-на-Майні': 'Німеччина',

        'м.Бидгощ': 'Польща',
        'м.Варшава': 'Польща',
        'м.Вроцлав': 'Польща',
        'м.Гданськ': 'Польща',
        'м.Краків': 'Польща',
        'м.Люблін': 'Польща',
        'м.Познань': 'Польща',


        'м.Лісабон': 'Португалія',

        'м.Бухарест': 'Румунія',
        'м.Клуж-Напока': 'Румунія',


        'м.Братислава': 'Словаччина',
        'м.Банська Бистриця': 'Словаччина',

        'м.Марібор': 'Словенія',

        'м.Нью-Йорк': 'США',
        'м.Сакраменто': 'США',

        'м.Анкара': 'Туреччина',

        'м.Будапешт': 'Угорщина',
        'м.Дебрецен': 'Угорщина',
        'м.Дьєр': 'Угорщина',

        'м.Гельсінкі': 'Фінляндія',

        'м.Бордо': 'Франція',
        'м.Марсель': 'Франція',
        'м.Париж': 'Франція',

        'м.Загреб': 'Хорватія',

        'м.Брно': 'Чехія',
        'м.Прага': 'Чехія',

        'м.Берн': 'Швейцарія',

        'м.Гетеборг': 'Швеція',
        'м.Стокгольм': 'Швеція',
}}

dct_code_area_2023 ={'Ірландія':'OC01000000000000000', 
                     'Іспанія':'OC02000000000000000',
                     'Італія':'OC03000000000000000', 
                     'Австрія':'OC04000000000000000', 
                     'Бельгія':'OC05000000000000000', 
                     'Болгарія':'OC06000000000000000', 
                     'Велика Британія':'OC07000000000000000', 
                     'Греція':'OC08000000000000000', 
                     'Грузія':'OC09000000000000000', 
                     'Данія':'OC10000000000000000', 
                     'Естонія':'OC11000000000000000',
                     'Канада':'OC12000000000000000', 
                     'Латвія':'OC13000000000000000', 
                     'Литва':'OC14000000000000000', 
                     'Люксембург':'OC15000000000000000', 
                     'Молдова':'OC16000000000000000', 
                     'Нідерланди':'OC17000000000000000', 
                     'Німеччина':'OC18000000000000000', 
                     'Польща':'OC19000000000000000', 
                     'Португалія':'OC20000000000000000', 
                     'Румунія':'OC21000000000000000',  
                     'Словаччина':'OC22000000000000000', 
                     'Словенія':'OC23000000000000000', 
                     'США':'OC24000000000000000',
                     'Туреччина':'OC25000000000000000', 
                     'Угорщина':'OC26000000000000000', 
                     'Фінляндія':'OC27000000000000000', 
                     'Франція':'OC28000000000000000', 
                     'Хорватія':'OC29000000000000000', 
                     'Чехія':'OC30000000000000000', 
                     'Швейцарія':'OC31000000000000000', 
                     'Швеція':'OC32000000000000000'}

dct_code_cities_2023 = {
        'м.Відень': 'OC04010000000000000',
        
        'м.Брюссель': 'OC05010000000000000',

        'м.Варна': 'OC06010000000000000',
        'м.Софія': 'OC06020000000000000',

        'м.Лондон': 'OC07010000000000000',

        'м.Афіни': 'OC08010000000000000',

        'м.Тбілісі': 'OC09010000000000000',

        'м.Копенгаген': 'OC10010000000000000',

        'м.Таллінн': 'OC11010000000000000',
        'м.Тарту': 'OC11020000000000000',

        'м.Мадрид': 'OC02010000000000000',

        'м.Барі': 'OC03010000000000000',
        'м.Мілан': 'OC03020000000000000',
        'м.Рим': 'OC03030000000000000',

        'м.Дублін': 'OC01010000000000000',

        'м.Едмонтон': 'OC12010000000000000',
        'м.Торонто': 'OC12020000000000000',

        
        'м.Рига': 'OC13010000000000000',

        'м.Каунас': 'OC14010000000000000',

        'м.Люксембург': 'OC15010000000000000',

        'м.Кишинів': 'OC16010000000000000',

        'м.Гронінген': 'OC17010000000000000',
        'м.Роттердам': 'OC17020000000000000',
        


        'м.Берлін': 'OC18010000000000000',
        'м.Гамбург': 'OC18020000000000000',
        'м.Кельн': 'OC18030000000000000',
        'м.Лейпциг': 'OC18040000000000000',
        'м.Мюнхен': 'OC18050000000000000',
        'м.Франкфурт-на-Майні': 'OC18060000000000000',

        'м.Бидгощ': 'OC19010000000000000',
        'м.Варшава': 'OC19020000000000000',
        'м.Вроцлав': 'OC19030000000000000',
        'м.Гданськ': 'OC19040000000000000',
        'м.Краків': 'OC19050000000000000',
        'м.Люблін': 'OC19060000000000000',
        'м.Познань': 'OC19070000000000000',


        'м.Лісабон': 'OC20010000000000000',

        'м.Бухарест': 'OC21010000000000000',
        'м.Клуж-Напока': 'OC21020000000000000',


        'м.Братислава': 'OC22010000000000000',
        'м.Банська Бистриця': 'OC22020000000000000',

        'м.Марібор': 'OC23010000000000000',

        'м.Нью-Йорк': 'OC24010000000000000',
        'м.Сакраменто': 'OC24020000000000000',

        'м.Анкара': 'OC25010000000000000',

        'м.Будапешт': 'OC26010000000000000',
        'м.Дебрецен': 'OC26020000000000000',
        'м.Дьєр': 'OC26030000000000000',

        'м.Гельсінкі': 'OC27010000000000000',

        'м.Бордо': 'OC28010000000000000',
        'м.Марсель': 'OC28020000000000000',
        'м.Париж': 'OC28030000000000000',

        'м.Загреб': 'OC29010000000000000',

        'м.Брно': 'OC30010000000000000',
        'м.Прага': 'OC30020000000000000',

        'м.Берн': 'OC31010000000000000',

        'м.Гетеборг': 'OC32010000000000000',
        'м.Стокгольм': 'OC32020000000000000'
}