MISSING_EOEDRPOU = {
    'UA23100110010062193': {
       'малинвськазагальноосвтняшкола3ступмалинвська': '26316960' 
    },
    'UA07080030080013164': {
        'городищенськазагальноосвтняшкола3ступен' :'21754111'
    },
    "UA46020050080049073": {
        "середняшколасдовг": "20829965",
       'довжанськийнавчальновиховнийкомплексзагальноосвтнйнавчальнийзаклад3ступдошкльнийнавчальнийзакла': "20830100",
    },
    "UA18040290030060642": {"березвськазагальноосвтняшкола3ступен": "22060652"},
    "UA68020190040012295": {"березвськазагальноосвтняшкола3ступен": "26495660"},
    "UA51140010210016149": {
        "навчальновиховальнийкомплексзагальноосвтняшкола3ступдитячийсадоксновоселвк": "26363757"
    },
    "UA68020090040084847": {"вльховецьказагальноосвтняшкола3ступен": "23562545"},
    "UA18040470090069061": {"вльшанськазагальноосвтняшкола3ступен": "22056509"},
    "UA14160050220079598": {
        "навчальновиховнийкомплексновоолександрвськазагальноосвтняшкола3ступдошкльнийнавчальнийзакладкрасноармйська": "25708065",
        "навчальновиховнийкомплексновоолександрвськазагальноосвтняшкола3ступдошкльнийнавчальнийзакладпокровська": "25708065",
    },
    'UA48060150010393291': {'миколавськийлцей1миколавська': '24780066'},
    "UA18080190060021466": {"киянськазагальноосвтняшкола3ступен": "22053907"},
    "UA18040030010064907": {"березвськазагальноосвтняшкола3ступен": "22060652"},
    "UA12020090050053281": {
        "миколавськагмназя2миколавська": "20265054",
        "миколавськазагальноосвтняшкола2": "20265054",
        "миколавськийлцей1миколавська": "20267188",
        "миколавськазагальноосвтняшкола13ступен": "20267188",
    },
    "UA18060190100096750": {"варварвськазагальноосвтняшкола3ступен": "06669939"},
    "UA14120210010032554": {
        "донбаськийаграрнийколеджсхдноукранськогонацональногоунверситетуменволодимирадал": "44843006"
    },
    "UA26040190010045761": {
        "лцейменванапулюяванофранквська": "25714640",
        "ванофранквськийколеджкивськогоунверситетунтелектуальнавласносттаправанацональногоунверситетуодеськаюридичнаакадем": "43452672",
    },
    "UA23060070010595678": {"запорзькийлцей105запорзька": "26251076"},
    "UA46080110250077507": {"гмназяспдгайчикирудквська": "22377886"},
    "UA68040470010096613": {
        "комунальнийгмназя27мендмитравахахмельницька": "25803088",
        'загальнасередньаосвтигмназя27мендмитравахахмельницька': "25803088",
        "комунальнийгмназя20менсергяфремовахмельницька": "21332444",
        'загальнасередньаосвтигмназя20менсергяфремовахмельницька': "21332444",
        "комунальнийгмназя26хмельницька": "21335800",
        'загальнасередньаосвтигмназя26хмельницька': "21335800",
        "комунальнийгмназя22менолегаольжичахмельницька": "22770997",
        'загальнасередньаосвтигмназя22менолегаольжичахмельницька': "22770997",
        "комунальнийгмназя29хмельницька": "22772312",
        'загальнасередньаосвтигмназя29хмельницька': "22772312",
        "гмназя23хмельницька": "22775807",
        "комунальнийгмназя28менвячеславачорноволахмельницька": "25803013",
        'загальнасередньаосвтигмназя28менвячеславачорноволахмельницька': "25803013",
        "комунальнийгмназя19менакадемкамихайлапавловськогохмельницька": "22764070",
        'загальнасередньаосвтигмназя19менакадемкамихайлапавловськогохмельницька': "22764070",
        "комунальнийгмназя25менвадимаангелахмельницька": "25908108",
        'загальнасередньаосвтигмназя25менвадимаангелахмельницька': "25908108",
        "комунальнийгмназя30хмельницька": "22771459",
        'загальнасередньаосвтигмназя30хмельницька': "22771459",
        "комунальнийгмназя21хмельницька": "22771465",
        'загальнасередньаосвтигмназя21хмельницька': "22771465",
        "комунальнийгмназя31менмихайлачекманахмельницька": "22787354",
        'загальнасередньаосвтигмназя31менмихайлачекманахмельницька': "22787354"
    },
    "UA74100390010122363": {
        "чернгвськагмназя28чернгвська": "25976073",
        "чернгвськагмназя3чернгвська": "25955757",
        "чернгвськагмназя29чернгвська": "25955711",
        "чернгвськагмназя2чернгвська": "25851259",
    },
    "UA56060350040097242": {"великомидськагмназякостопльська": "24170706"},
    "UA59080270010111002": {"вйськовийлцейдержавнаприкордонаслужбиукран": "38245193"},
    "UA46100230010074173": {
        "стрийськагмназя10стрийська": "22414570",
        "стрийськагмназя7стрийська": "22414848",
    },
    "UA23100210040036222": {
        "вльнянськафляпреображенськагмназосновапреображенська": "20527353"
    },
    "UA73060610010033137": {
        "чернвецькийколеджкивськогоунверситетунтелектуальнавласносттаправанацональногоунверситетуодеськаюридичнаакадем": "43452672"
    },
    "UA74100390010268220": {
        "чернгвськагмназя32чернгвська": "26544237",
        "чернгвськагмназя34чернгвська": "25975346",
    },
    "UA05080110150072257": {
        "флякачквськагмназядовжоцькоголцеюямпльська": "25512706"
    },
    "UA07060310010081210": {"опорнийзакладосвтиратнвськийлцей1ратнвська": "21747967"},
    "UA32020150070079340": {
        "горобвськийнавчальновиховнийкомплекс3ступзакладдошкльнаосвтисквирська": '25303204'
    },
    "UA59020090010081204": {
        "кролевецькагмназя5кролевецька": "24010902",
        "кролевецькагмназя1кролевецька": "24010859",
        "кролевецькагмназя2менмолукашакролевецька": "24010888",
        "кролевецькагмназя6кролевецька": "24010954",
    },
    "UA18060090010074365": {"коростенськагмназя3": "22061315"},
    "UA12120090010057273": {
        "тернвськагмназя6тернвська": "23068785",
        "тернвськагмназя4тернвська": "23066148",
        "тернвськагмназя1тернвська": "23066154",
    },
    "UA71040190030071064": {"богодухвськагмназячорнобавська": "33268738"},
    "UA80000000000126643": {
        "кивськийнацональнийунверситетментарасашевченк": "02070944"
    },
    "UA48060150010139573": {
        "миколавськагмназя4менмолчановабмиколавська": "24780333"
    },
    "UA51120070040077387": {"гвоздавськагмназязеленогрська": "26470223"},
    "UA53040030010081016": {
        "гмназяменгерояукраниврираклубенська": "25165860"
    },
    "UA73060010010023298": {
        "боянськийлцейлдерменонанекульчебоянська": "21450233"
    },
    "UA74040250010023991": {"нжинськагмназя15основанжинська": "26467882"},
    "UA46080110300059712": {"гмназясхлопчицрудквська": "22377946"},
    "UA32060030010087257": {"березанськагмназя2березанська": "22203086"},
    "UA48060310110044893": {
        "новокатеринвськагмназястепвська": "26108901"
    },
    "UA07080170010083384": {
        "комунальнийлуцькийлцей28луцьказпосиленоюфзичноюпдготовко": "21733534",
        'загальнасередньаосвтилуцькийлцей28луцьказпосиленоюфзичноюпдготовко': "21733534"
    },
    "UA46100070120051694": {"лисквськагмназяжуравненська": "22406122"},
    "UA80000000000479391": {"гмназя81мкив": "23392118", "гмназя195мкив": "23392149"},
    "UA23060070010618511": {
        "вищаосвтихортицьканацональнанавчальнореаблтацйнаакадемязапорзькаобласно": "22133718"
    },
    "UA46100230420039160": {"стрлквськагмназястрийська": "22389180"},
    "UA68040090010095929": {"волочиськийлцей3волочиська": "06722024"},
    "UA68040470240061055": {
        "комунальнийшаровечквськагмназяхмельницька": "26038365",
        'загальнасередньаосвтишаровечквськагмназяхмельницька': "26038365",
    },
    "UA12040150010118924": {
        "гмназя21камянська": "20295380",
        "донбаськийколеджтехнологйтауправлн": "00173462",
    },
    "UA48040070010053688": {
        "вознесенськагмназя3вознесенська": "25877342"
    },
    "UA14120030010055241": {
        "гмназя12дружквська": "25705121",
        "гмназя1дружквська": "25703010",
        "гмназя7дружквська": "25705078",
        "гмназя6дружквська": "25705061",
    },
    "UA12020010010639502": {
        "вищаосвтиднпровськаакадемянеперервнаосвтиднпропетровськаобласно": "41682253"
    },
    "UA46020030160079337": {
        "лшнянськийнавчальновиховнийкомплексзагальноосвтнйнавчальнийзаклад3ступдошкльнийнавчальнийзакладдрогобицька": "20830092"
    },
    "UA53060230010027681": {
        "рубжанськийколедждержавногозакладулуганськийнацональнийунверситетментарасашевченк": "33702395"
    },
    "UA14160210280046630": {
        "србненський3ступменагчерненказдошкльнимпдроздломпокровська": "25703375"
    },
    "UA48040130240037936": {"нововасилвськагмназяланецька": "26118420"},
    "UA71040190090053773": {
        "красенвськагмназяванамаксимовичапддубногочорнобавська": "33392298"
    },
    "UA12020010010757287": {"бахмутськийколеджтранспортнанфраструктур": "01116199"},
    "UA46120110010087965": {
        "льввськаобласнасокальськазагальноосвтнясанаторнашкола3ступментшевченк": "04545340"
    },
    "UA46080110260025386": {"гмназяспогрцрудквська": "22377646"},
    "UA80000000000624772": {"гмназя134мкив": "32492388"},
    "UA32020170030029238": {"бесдськагмназяставищенська": "25657965"},
    "UA12020050010036263": {"любимвськагмназялюбимвська": "26462241"},
    "UA23080170060039287": {"мелтопольськевищепрофесйнеучилищ": "02544052"},
    "UA35040110010034377": {"гмназямрядолинська": "33321426"},
    "UA14120030040015027": {"гмназя14дружквська": "25705138"},
    "UA59020090020077404": {"алтинвськагмназякролевецька": "24010925"},
    "UA12020010010114149": {"вищепрофесйнеучилище55днпровська": "02549598"},
    "UA46140070010067363": {
        "опорнийзакдадсудововишнянський3ступзакладдошкльнаосвтиментадеядмитрасевичасудововишнянська": "22364961"
    },
    "UA12100010060039409": {"вльненськагмназягубиниська": "26367991"},
    "UA68020110010097898": {
        "камянецьподльськийлцей2ментгшевченкакамянецьподльська": "22784054"
    },
    "UA56060350010063070": {"костопльськагмназя2костопльська": "36950859"},
    "UA21020130030051448": {"фля1камянськоголцеюкамянська": "22100083"},
    "UA48040130160048227": {"калинвськагмназяланецька": "26118377"},
    "UA35040230060045506": {
        "верблюзькийлцейновгородквська": "33329116"
    },
    "UA12140210010011011": {
        "першотравенськагмназя3першотравенська": "19433836",
        "першотравенськагмназя1першотравенська": "26329192",
    },
    "UA48040130060027405": {
        "великосербулвськагмназяланецька": "26118354"
    },
    "UA63120270010216514": {
        "фляхарквськийприватнийлцейнароднаукранськаакадемяприватногозакладувищаосвтихарквськогогумантарногоунверситетународнаукранськаакдем": "45413389"
    },
    "UA48060150010235917": {
        "миколавськийколеджбзнесуправаполтавськогоунверситетуекономкиторгвл": "36984810"
    },
    "UA48040130010093076": {"ланецькагмназяланецька": "26445515"},
    "UA48040050110065438": {
        "зеленвськафляколосвськоголцеювеселинвська": "41080611"
    },
    "UA12040150010213957": {"гмназя18камянська": "23370739"},
    "UA71040150140061541": {
        "фляподльськагмназяздошкльнимпдроздломопорногозакладуосвтиноводмитрвськийлцейноводмитрвська": "45411910"
    },
    "UA12020010010512802": {
        "словянськийколеджтранспортнанфраструктур": "01116182",
        "донецькийколеджсхдноукранськогонацональногоунверситетуменволодимирадал": "44870616",
    },
    "UA46100230380073772": {"семигинвськагмназястрийська": "22390022"},
    "UA23060070010474202": {
        "запорзькийдержавниймедикофармацевтичнийунверсите": "45030873"
    },
    "UA46080110160030280": {
        "гмназяздошкльнимпдроздломслукирудквська": "22377596"
    },
    "UA48020190160010210": {
        "павлвськагмназязпочатковоюшколоютадошкльнимпдроздломснгурвська": "40798856"
    },
    "UA59020090220056437": {"дубовицькагмназякролевецька": "24010842"},
    "UA71040150080010528": {
        "фляковтунвськагмназяздошкльнимпдроздломопорногозакладуосвтиноводмитрвськийлцейноводмитрвська": "45580787"
    },
    "UA71020290320054359": {
        "тальянквськийагротехнчнийколеджуманськогонацональногоунверситетусадвництв": "00729103"
    },
    "UA71060170130075092": {
        "княжекриницькийлцеймонастирищенська": "24415800"
    },
    "UA07080250340079406": {
        "комунальнийсокльськагмназярожищенська": "20140789",
        'загальнасередньаосвтисокльськагмназярожищенська': "20140789",
    },
    "UA61020070060065676": {
        "великобережецькагмназякременецька": "23591133"
    },
    "UA61060430010047348": {
        "чортквськагмназя3менроманальяшенкачортквська": "21168850"
    },
    "UA18060090350068616": {"сарновицькагмназякоростенська": "22056366"},
    "UA23040150060043028": {
        "тополинськазагальноосвтняшкола3ступмалоблозерськавасилвськог": "26292033"
    },
    "UA32120170020020878": {
        "гвоздвськафляопорногозакладуходосвськийлцейфеодосвська": "44539539"
    },
    "UA46080110310070826": {
        "гмназяздошкльнимпдроздломсчайковичрудквська": "22378584"
    },
    "UA46140110120034423": {
        "вжомлянськагмназяменванасеверияворвська": "22398894"
    },
    "UA80000000001078669": {
        "укранськийдержавнийунверситетменмихайладрагоманов": "44807628"
    },
    "UA61040170370085193": {"перепельницькагмназязборвська": "21164622"},
    "UA65100170050033648": {"киселвськагмназячорнобавська": "22739177"},
    "UA46100230230042645": {"ланвськагмназястрийська": "22389903"},
    "UA14160190170079796": {
        "новоселвськафляочеретинськийнавчальновиховнийкомплексзагальноосвтняшкола3ступзпоглибленимвивченямокремихпредметвтакурсвдошкльнийнавчальнийзакладочеретинськавйськовоцивльнаадмнстрац": "25703091"
    },
    "UA53080370010183642": {
        "брянквськийколедждержавногозакладулуганськийнацональнийунверситетментарасашевченк": "03062912"
    },
    "UA63120070030026955": {"прудянськийлцейдергачвська": "23325087"},
    "UA61020070400082884": {"сапанвськагмназякременецька": "23591162"},
    "UA53080050030084167": {
        "андрвськафляопорногозакладудиканськийлцейменмвгоголядиканська": "41559589"
    },
    "UA46060250010515336": {
        "педагогчнийколеджльввськогонацональногоунверситетуменванафранк": "40077629"
    },
    "UA18060090410038970": {"холосненськагмназякоростенська": "22056343"},
    "UA26120030010073051": {
        "делятинськафля1делятинськоголцею1делятинська": "20559985"
    },
    "UA51040130040010371": {
        "флявипаснянськагмназя1озовипаснянськийлцеймологвська": "44487135",
        "флявипаснянськагмназя2озовипаснянськийлцеймологвська": "44548585",
    },
    "UA56060430060010885": {"кустинськагмназяолександрйська": "25316744"},
    "UA35040250460076324": {
        "староосотськафляолександрвськийлцей1олександрвська": "40594926"
    },
    "UA18040470140016261": {
        "гордвськафляроманвськоголцею2романвська": "44699563"
    },
    "UA53060290090030858": {"сковецькагмназясенчанська": "23548509"},
    "UA59040130330037571": {
        "солдатський3ступзакладдошкльнаосвтименмгенднатростянецька": "24012887"
    },
    "UA71040190100091000": {"лукашвськагмназячорнобавська": "33409217"},
    "UA21100270010071297": {
        "чопський3ступ2менштванасеченчопська": "22098658"
    },
    "UA71040190230091027": {"хрестителвськагмназячорнобавська": "33369866"},
    "UA59020090660020456": {"тулиголвськагмназякролевецька": "24010718"},
    "UA59020090480079185": {"обтвськагмназякролевецька": "24010753"},
    "UA80000000000551439": {
        "приватнаорганзацяприватнийднпровськийлцейальтерраскулднпр": "44871604"
    },
    "UA07060310190090794": {
        "млинвськагмназяфляопорногозакладуосвтикортелськийлцейменвасилякорнелюкаратнвська": "21747921"
    },
    "UA59020090440086664": {"мутинськагмназякролевецька": "24010724"},
    "UA26080070010075786": {
        "коломийськафля6менгерояукранитарасасенюкаколомийськоголцею9коломийська": "20560936",
        "нститутуправлняприроднимиресурсамивищогонавчальногозакладуунверситетекономкитаправакро": "04635922",
    },
    "UA56060070090054073": {
        "посягввськафляопорногозакладубугринськийлцейбугринська": "26009978"
    },
    "UA32100050030071631": {"блдчанськафляванквськоголцею1ванквська": "24887338"},
    "UA48040130210020587": {"маложенвськагмназяланецька": "26118437"},
    "UA32120110210060803": {
        "фляакадемчноголцею1менасмалишкаобухвськапершотравенськагмназ": "43956498"
    },
    "UA61060370140065384": {
        "нирквськазагальноосвтняшкола3ступтернопльськаоб": "24625199"
    },
    "UA12140070070051590": {
        "добровльськагмназядубовиквська": "26461856"
    },
    "UA26120050050070842": {
        "середньомайданськагмназяланчинська": "20568797"
    },
    "UA48020190100085300": {
        "калинвськагмназязпочатковоюшколоютадошкльнимпдроздломснгурвська": "26117001"
    },
    "UA48060310070067545": {
        "криничанськагмназяменвкторалаврентйовичамусякистепвська": "26087240"
    },
    "UA12020010010475293": {
        "курахвськафляднпровськогофаховогоколеджуенергетичнихтанформацйнихтехнолог": "04626966"
    },
    "UA48060310060030531": {"катеринвськагмназястепвська": "26108953"},
    "UA48020190070071619": {
        "вгенвськагмназязпочатковоюшколоютадошкльнимпдроздломснгурвська": "40799493"
    },
    "UA05080110020015930": {
        "флябезводнвськагмназядзигвськоголцеюямпльська": "13325904"
    },
    "UA46080110220021512": {
        "гмназяздошкльнимпдроздломсновослкигостинрудквська": "22377627"
    },
    "UA51080070010065897": {
        "ренйськафля1опорногозакладуренйськийлцей1ренйська": "44461782"
    },
    "UA61040430150045989": {
        "теклвськафляскалатськоголцеюскалатська": "24621675"
    },
    "UA26040330030092668": {"клубовецькафлятисменицькоголцеютисменицька": "45341236"},
    "UA59040130010060037": {
        "тростянецькафля42ступзакладузагальнасередньаосвти3ступ3тростянецька": "22593437",
        "тростянецькафля12ступзакладузагальнасередньаосвти3ступзакладудошкльнаосвти5тростянецька": "24903149",
    },
    "UA23060070010154443": {"днпрорудненськийндустральнийколед": "00193594"},
    "UA35040250010018304": {
        "олександрвськафляолександрвськийлцей1олександрвська": "40594926"
    },
    "UA53080090090011464": {
        "флявеликопавлвськагмназязньквськогоопорноголцею1зньквська": "45165536"
    },
    "UA51020190070070383": {
        "фляопорногозакладуосвтипетроврвськийлцейновосвтвськагмназяпетроврвська": "43700733"
    },
    "UA35020050130064577": {
        "солгутвськагмназягайворонська": "34085511"
    },
    "UA48020170090063680": {"лукянвськагмназяпривльненська": "31529097"},
    "UA63040050010023832": {
        "борвськазагальноосвтняшкола2ступ2фляокружногоопорногозакладуборвськазагальноосвтняшкола3ступ1менгероярадянськогосоюзувсколсникаборвська": '25694854'
    },
    "UA48020190180041212": {
        "першотравневагмназязпочатковоюшколоютадошкльнимпдроздломснгурвська": "26117107"
    },
    "UA56060450040092845": {"блашвськагмназяострозька": "24176710"},
    "UA68040470080013292": {
        "комунальнийдавидковецькагмназяхмельницька": "23563326",
        'загальнасередньаосвтидавидковецькагмназяхмельницька': "23563326",
    },
    "UA51120070070093251": {"познанськагмназязеленогрська": "26457040"},
    "UA65020010010095508": {
        "флябериславськогоопорногозакладуакадемчнийлцейбериславська": "43205519"
    },
    "UA32040210300071279": {"сулимвськафляяготинськоголцею1яготинська": "44488191"},
    "UA56060350170048285": {"малостидинськагмназякостопльська": "24173314"},
    "UA63120070100084991": {
        "великопроходвськафляруськолозвськийлцейдергачвська": "45637324"
    },
    "UA63060050020083029": {
        "берестовеньквськафлякрасноградськоголцею4красноградська": "45463204"
    },
    "UA65060010070035580": {
        "молочнянськафляопорногозакладунавчальновиховнийкомплексзагальноосвтняшкола3ступдошкльнийнавчальнийзакладпозашкльнийнавчальнийзакладгмназяасканянова": "14141945"
    },
    "UA14160190130054690": {
        "новобахмутвськафляочеретинськийнавчальновиховнийкомплексзагальноосвтняшкола3ступзпоглибленимвивченямокремихпредмакурсвдошкльнийнавчальнийзакладочеретинськавйськовоцивльнаадмнстрац": "25703091"
    },
    "UA61060170120090968": {
        "добрвлянськафляспецалзованашколи3ступменосмаковеязпоглибленимвивченямнформацйнихтехнологйтатехнологчнихдисциплнмзалщик": "37411481"
    },
    "UA56060030370079201": {
        "яцьковицькафляопорногозакладубалашвськийлцейберезнвська": "41772818"
    },
    "UA59080170030096327": {
        "великорибицькафлямиропльськоголцеюмиропльська": "46076002"
    },
    "UA46060250010121390": {
        "льввськаобласнальввськиймузичнийколеджменсплюдкевич": "02214745"
    },
    "UA73060370100041186": {
        "флядрачинецькогоопорногозакладузагальнасередньаосвти3ступмамавськановодрачинецькийступен": "44063405"
    },
    "UA32040010010093209": {"академямжнароднаосвт": "45261580"},
    "UA07040030380048033": {
        "хоцунськагмназяфляопорногозакладузагальнасередньаосвтилюбязвськийлцейлюбешвська": "41604479"
    },
    "UA61060370180049715": {
        "загальноосвтняшкола3ступссадк": "24625213"
    },
    "UA48020190060079184": {
        "галаганвськагмназязпочатковоюшколоютадошкльнимпдроздломснгурвська": "40799446"
    },
    "UA46060250010615203": {
        "льввськийколеджкивськогоунверситетукультур": "39686458",
        "приватнаорганзацяприватнийльввськийлцейальтерраскулльв": "44937392",
    },
    "UA71020190170017991": {
        "чаплинськагмназяфляопорногозакладубоярськийлцейлисянська": "24359711"
    },
    "UA05020030010063857": {"вницькийприватнийнауковийлцейсинкглоба": "42292925"},
    "UA51100010010083015": {
        "комунальнийавангардвськагмназяавангардська": "43137973",
        'загальнасередньаосвтиавангардвськагмназяавангардська': "43137973",},
    "UA74040050010084586": {"бобровицькагмназябобровицька": "25572499"},
    "UA68060090080072719": {
        "флязяславськогонавчальновиховногокомплексузагальноосвтняшкола3ступ5меноонищукагмназяваськовецькийнавчальновиховнийкомплексзагальноосвтняшкола2ступдитячийсадокзяславська": '25879693'
    },
    "UA32120030010069648": {
        "закладувищаосвтивдкритиймжнароднийунверситетрозвиткулюдиниукранавасильквськийколед": "26408856"
    },
    "UA71040190110078502": {"малобурмськагмназячорнобавська": "33376365"},
    "UA51140150090049172": {
        "марквськафляяковлвськогоопорногозакладузагальнасередньаосвтистепанвська": "25038104"
    },
}
